seL4Understanding.tex
% Created 2021-03-04 Thu 14:00
% Intended LaTeX compiler: pdflatex
\documentclass[presentation,dvipdfmx,CJKbookmarks]{beamer}
\usepackage{bxdpx-beamer}
\usepackage{CJKutf8}
\usepackage{atbegshi}
\AtBeginShipoutFirst{\special{pdf:tounicode UTF8-UTF16}} % for UTF-8
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage[export]{adjustbox}
\usepackage{lmodern}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
 \usepackage{minted}
\usetheme{EastLansing}
\usecolortheme{default}

\date{2021-02-25}


\hypersetup{
 pdfauthor={包昊军},
 pdftitle={seL4\thinspace 源码解析},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)},
 pdflang={English}}
\begin{document}
\begin{CJK*}{UTF8}{simsun}

\title{seL4\thinspace 源码解析}
\subtitle{学习笔记}
\author{包昊军}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}

\CJKtilde

\section{Capability}
\label{sec:org07db88d}
\begin{frame}[label={sec:org91f5184}]{什么是\thinspace Capability？（Wikipedia）}
\begin{enumerate}
\item 使用起来很像文件句柄，但是区别在于

\begin{itemize}
\item 一般需要提前分配，而非通过自己打开文件获取句柄
\item 适用于系统中所有对象，而非仅限于文件
\end{itemize}

\item 在用户态，Capability\thinspace 只用一个整型表示（类似于一个内存地址，可以指向一个更复杂的对象的存储空间）

\item 在内核态，Capability\thinspace 被压缩到只用两个整型表示（非常关键并且常用的数据结构，必须考虑存储优化）
\end{enumerate}
\end{frame}

\begin{frame}[label={sec:org5b08469},fragile]{内核态的\thinspace Capability\thinspace 表示}
 前面已经说了，在内核态，Capability\thinspace 通过两个整型的存储表示，方法如下：

\begin{enumerate}
\item 参考面向对象的方法，有一个「Capability\thinspace 父类」，其满足所有子类的共同特性，参考如下伪代码：

\begin{minted}[]{c++}
enum cap_tag {
    cap_null,
    cap_node,
    cap_thread,
    cap_frame,
    //...
};

struct Capability {
    enum cap_tag tag; // 用于\thinspace RTTI\thinspace 的类型标签
};
\end{minted}

\item 但是，考虑到\thinspace struct\thinspace 数据结构会依赖于具体的编译器，实际上在\thinspace seL4\thinspace 里这个数据结构是通过\thinspace \texttt{.bf}\thinspace 文件定义，并生过\thinspace python\thinspace 文件自动解析生成\thinspace c\thinspace 源码。

这里定义的是\thinspace cap\thinspace 可以用两个整型表示（64\thinspace 位系统，128 bits）：
\begin{minted}[]{bf}
struct cap {
    uint64_t words[2];
};
typedef struct cap cap_t;
...
\end{minted}

这里定义的是不同的「子类」的类型：
\begin{minted}[]{bf}
enum cap_tag {
    cap_null_cap = 0,
    cap_untyped_cap = 2,
    cap_endpoint_cap = 4,
    cap_notification_cap = 6,
    // ...
};
\end{minted}

这里定义的是\thinspace frame cap（操作页帧的能力），最后一列的数字是\thinspace bit\thinspace 数，你可以自己加一下，是否最后加起来是\thinspace 128 bits。
\begin{minted}[]{bf}
block frame_cap {
    field       capFMappedASID      16
    field_high  capFBasePtr         39
    padding                         9

    field       capType             5
    field       capFSize            2
    field       capFVMRights        2
    field       capFIsDevice        1
    padding                         15
    field_high  capFMappedAddress   39
}
\end{minted}

\item 最后，会自动生成很多类似\thinspace C++面向对象的\thinspace method\thinspace 定义：

\begin{itemize}
\item 这是一个构建函数：

\begin{minted}[]{c}
static inline cap_t __attribute__((__const__))
cap_frame_cap_new(uint64_t capFMappedASID,
                  uint64_t capFBasePtr,
                  uint64_t capFSize,
                  uint64_t capFMapType,
                  uint64_t capFMappedAddress,
                  uint64_t capFVMRights,
                  uint64_t capFIsDevice) {
    // ...
}

\end{minted}

\item 这是一个\thinspace getter，通过操作\thinspace bits\thinspace 移位实现（注意因为是自动生成，所以其中有一些看上去多余的代码，比如\thinspace \texttt{ret |= 0x0;}）：

\begin{minted}[]{c}
static inline uint64_t CONST
cap_frame_cap_get_capFIsDevice(cap_t cap) {
    uint64_t ret;
    assert(((cap.words[0] >> 59) & 0x1f) ==
           cap_frame_cap);

    ret = (cap.words[0] & 0x10ull) >> 4;
    /* Possibly sign extend */
    if (__builtin_expect(!!(0 && (ret & (1ull << (47)))), 0)) {
        ret |= 0x0;
    }
    return ret;
}
\end{minted}
\end{itemize}
\end{enumerate}
\end{frame}
\end{CJK*}
\end{document}
